src/Documents/ИзменениеСостоянияПроектов/ИзменениеСостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИзменениеСостоянияПроектов</name>
  <registerRecords>InformationRegister.УП_ВремяВыполнениеПроектов_План</registerRecords>
  <registerRecords>InformationRegister.ВремяВыполненияПроектов</registerRecords>
  <registerRecords>InformationRegister.СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СостоянияПроектов</registerRecords>
  <registerRecords>InformationRegister.УП_СтоимостьПроектов</registerRecords>
  <registerRecords>InformationRegister.СтоимостьПроектов</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИзменения</name>
    <type>
      <types>EnumRef.ВидыИзмененийСостоянийПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Проекты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполненияТекущее</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяВыполнения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроекта</name>
      <type>
        <types>EnumRef.СостоянияПроектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ВремяВыполненияПроектов/ВремяВыполненияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВремяВыполненияПроектов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Исполнители</types>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения_План</name>
    <comment>в минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВремяВыполнения_Факт</name>
    <comment>в минутах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РегистраторСсылка</name>
    <type>
      <types>DocumentRef.ВыполнениеПроектов</types>
      <types>DocumentRef.СогласованиеПроектов</types>
      <types>DocumentRef.ИзменениеСостоянияПроектов</types>
      <types>DocumentRef.ВыполнениеРаботНадПроектом</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СостоянияПроектов/СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПроектов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтоимостьПроектов/СтоимостьПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьПроектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПроектаВВалютеУчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаПроекта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВалютаУчета</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_ВремяВыполнениеПроектов_План/УП_ВремяВыполнениеПроектов_План.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_ВремяВыполнениеПроектов_План</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ВремяВыполнения</name>
    <comment>(в минутах)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_СостоянияПроектов/УП_СостоянияПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_СостоянияПроектов</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПроектов</types>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УП_СтоимостьПроектов/УП_СтоимостьПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УП_СтоимостьПроектов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>АналитикаУчетаПоКонтрагентам</name>
    <type>
      <types>CatalogRef.КлючиАналитикиУчетаПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидыИзмененийСостоянийПроектов/ВидыИзмененийСостоянийПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИзмененийСостоянийПроектов</name>
  <enumValues>
    <name>ЭтапВыполнения</name>
  </enumValues>
  <enumValues>
    <name>ВремяВыполнения</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИзменениеСостоянияПроектов/ObjectModule.bsl
//////////////////////////////////////////////////////////////////////////////////
//// РАЗДЕЛ ПРОЦЕДУР И ФУНКЦИЙ

// Обработка проведения.
// ................................................................................
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// очищаем все движеня
	Движения.ВремяВыполненияПроектов.Очистить();
	Движения.ВремяВыполненияПроектов.Записать();
	Движения.СостоянияПроектов.Очистить();
	Движения.СостоянияПроектов.Записать();
	Движения.СтоимостьПроектов.Очистить();
	Движения.СтоимостьПроектов.Записать();
	Движения.УП_ВремяВыполнениеПроектов_План.Очистить();
	Движения.УП_ВремяВыполнениеПроектов_План.Записать();
	Движения.УП_СостоянияПроектов.Очистить();
	Движения.УП_СостоянияПроектов.Записать();
	Движения.УП_СтоимостьПроектов.Очистить();
	Движения.УП_СтоимостьПроектов.Записать();
	
	Если ВидИзменения = Перечисления.ВидыИзмененийСостоянийПроектов.ЭтапВыполнения Тогда
		// регистр СостоянияПроектов
		// (устарело, но используется)
		Движения.СостоянияПроектов.Записывать = Истина;
		// регистр УП_СостоянияПроектов
		Движения.УП_СостоянияПроектов.Записывать = Истина;
		Для Каждого ТекСтрокаПроекты Из Проекты Цикл
			Движение            = Движения.СостоянияПроектов.Добавить();
			Движение.Период     = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Проект     = ТекСтрокаПроекты.Проект;
			Движение.Состояние  = ТекСтрокаПроекты.СостояниеПроекта;
			
			ПараметрыАналитики = Новый Структура();
			ПараметрыАналитики.Вставить("Контрагент", Контрагент);
			ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
			ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
			Движение                              = Движения.УП_СостоянияПроектов.Добавить();
			Движение.Период                       = Дата;
			Движение.АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
			Движение.Состояние                    = ТекСтрокаПроекты.СостояниеПроекта;
		КонецЦикла;
	ИначеЕсли ВидИзменения = Перечисления.ВидыИзмененийСостоянийПроектов.ВремяВыполнения Тогда
		// регистр ВремяВыполненияПроектов
		// (устарело, но используется)
		Движения.ВремяВыполненияПроектов.Записывать = Истина;
		// регистр СтоимостьПроектов
		// (устарело, но используется)
		Движения.СтоимостьПроектов.Записывать = Истина;
		
		// регистр УП_СтоимостьПроектов
		Движения.УП_СтоимостьПроектов.Записывать = Истина;
		// регистр УП_ВремяВыполнениеПроектов_План
		Движения.УП_ВремяВыполнениеПроектов_План.Записывать = Истина;
		Для Каждого ТекСтрокаПроекты Из Проекты Цикл
			Движение                      = Движения.ВремяВыполненияПроектов.Добавить();
			Движение.РегистраторСсылка    = Ссылка;
			Движение.Контрагент           = Контрагент;
			Движение.Проект               = ТекСтрокаПроекты.Проект;
			Движение.ВремяВыполнения_План = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрокаПроекты.ВремяВыполнения);
			Движение.ВремяВыполнения_Факт = 0;
			
			Движение                          = Движения.СтоимостьПроектов.Добавить();
			Движение.Период                   = Дата;
			Движение.Контрагент               = Контрагент;
			Движение.ВалютаПроекта            = ТекСтрокаПроекты.Валюта;
			Движение.ВалютаУчета              = Константы.ВалютаУчета.Получить();
			Движение.Проект                   = ТекСтрокаПроекты.Проект;
			Движение.СуммаПроекта             = ТекСтрокаПроекты.Сумма;
			Движение.СуммаПроектаВВалютеУчета = ТекСтрокаПроекты.Сумма*УП_ОбщегоНазначения_Сервер.ПолучитьАктуальныйКурсВалюты(Дата, ТекСтрокаПроекты.Валюта);
			
			
			ПараметрыАналитики = Новый Структура();
			ПараметрыАналитики.Вставить("Контрагент", Контрагент);
			ПараметрыАналитики.Вставить("Клиент"    , ТекСтрокаПроекты.Клиент);
			ПараметрыАналитики.Вставить("Проект"    , ТекСтрокаПроекты.Проект);
			АналитикаУчетаПоКонтрагентам = УП_РаботаСДокументамиСервер.ЗначениеКлючаАналитики(ПараметрыАналитики);
			
			Движение                              = Движения.УП_СтоимостьПроектов.Добавить();
			Движение.Период                       = Дата;
			Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
			Движение.Валюта                       = ТекСтрокаПроекты.Валюта;
			Движение.Сумма                        = УП_РаботаСДокументамиСервер.ПолучитьПлановуюТекущуюСтоимостьПроекта(Дата - 1, АналитикаУчетаПоКонтрагентам) + ТекСтрокаПроекты.Сумма;
			
			Движение                              = Движения.УП_ВремяВыполнениеПроектов_План.Добавить();
			Движение.Период                       = Дата;
			Движение.АналитикаУчетаПоКонтрагентам = АналитикаУчетаПоКонтрагентам;
			ТекущееВремяВыполнения    = УП_РаботаСДокументамиСервер.ПолучитьТекущееВремяВыполнения(Дата - 1, АналитикаУчетаПоКонтрагентам);
			ИзмененноеВремяВыполнения = УП_ОбщегоНазначения_Сервер.ПреобразоватьВремя(ТекСтрокаПроекты.ВремяВыполнения);
			Движение.ВремяВыполнения              = ТекущееВремяВыполнения + ИзмененноеВремяВыполнения;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
